Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: Triangle opacity.
it_it: Opacità del triangolo.

source: Triangles are defined by :cpp:type:`lv_draw_triangle_dsc_t`, which includes:
it_it: I triangoli sono definiti da :cpp:type:`lv_draw_triangle_dsc_t`, che include:

source: Triggers
it_it: Trigger

source: Triple buffering enhances parallelism between rendering and data transfer compared to double buffering.
it_it: Il triplo buffering migliora il parallelismo tra rendering e trasferimento dati rispetto al doppio buffering.

source: Trolling, insulting/derogatory comments, and personal or political
it_it: Trolling, commenti offensivi/dispregiativi e

source: Troubleshooting
it_it: Risoluzione dei problemi

source: Try increasing :c:macro:`LV_MEM_SIZE`.
it_it: Provare ad aumentare :c:macro:`LV_MEM_SIZE`.

source: Try it out with the newest LVGL Pro Editor.
it_it: Da provarlo con il nuovissimo editor LVGL Pro.

source: Try the following code without using LVGL.
it_it: Provare il seguente codice senza usare LVGL.

source: Try:
it_it: Provare:

source: Turn on compiler optimization and enable instruction- and data-caching if your MCU has them.
it_it: Attivare l'ottimizzazione del compilatore e abilitare la memorizzazione nella cache di istruzioni e dati, se disponibile sull'MCU.

source: Turn the Preview Pane into an Inspector by holding down the [Ctrl] key.
it_it: Trasforma il "Pannello Preview" in un "Inspector" tenendo premuto il tasto [Ctrl].

source: Turning this option on implies that the resources generated by the image generation script will include ``lvgl.h`` as a system include.
it_it: L'attivazione di questa opzione implica che le risorse generate dallo script di generazione dell'immagine includeranno ``lvgl.h`` come "include" di sistema.

source: Tutorials
it_it: Tutorial

source: Tutorials, examples, themes for rapid GUI design
it_it: Tutorial, esempi, temi per la progettazione rapida di interfacce grafiche (GUI)

source: Two Buffers
it_it: Due Buffer

source: Two fingers pinch (up and down)
it_it: Pizzico con due dita (su e giù)

source: Two fingers rotation
it_it: Rotazione con due dita

source: Two fingers swipe (infinite)
it_it: Scorrimento con due dita (infinito)

source: Two or multiple steps would be required.
it_it: Sarebbero necessari due o più passaggi.

source: Two-Fingered Scroll
it_it: Scorrimento con due dita

source: Type
it_it: Tipo

source: Type "preferences" and select the option "Preferences: Open User Settings (JSON)" from the choices.
it_it: Digitare "preferences" e selezionare l'opzione "Preferences: Open User Settings (JSON)" tra le opzioni.

source: Type (governs how a chart's data series are drawn)
it_it: Tipo (regola il modo in cui vengono disegnate le serie di dati di un grafico)

source: Type the following commands in a terminal window:
it_it: Digitare i seguenti comandi in una finestra di terminale:

source: Type-specific defaults (e.g., 0, false, NULL)
it_it: Valori di default specifici del tipo (ad esempio, 0, false, NULL)

source: Typedefs
it_it: Typedef

source: Types
it_it: Tipi

source: Types can be compound, meaning multiple options/types are possible.
it_it: I tipi possono essere composti, ovvero sono possibili più opzioni/tipi.

source: Typesetting
it_it: Composizione

source: Typical Background Properties
it_it: Proprietà Tipiche del Background

source: Typical use cases for this are modifying each bar of a bar chart, or cells of a table.
it_it: Casi d'uso tipici sono la modifica di ogni barra di un grafico a barre o delle celle di una tabella.

source: Typically the Base Widget is used for this purpose since it has all the features most Screens need.
it_it: In genere, a questo scopo viene utilizzato il "Base Widget", poiché possiede tutte le funzionalità necessarie alla maggior parte delle schermate.

source: Typically the middle image should be one of the set image sources.
it_it: In genere, l'immagine centrale dovrebbe essere una delle sorgenti di immagini impostate.

source: Typically these are implemented by calling the appropriate SDK library functions on the given platform.
it_it: In genere, queste vengono implementate richiamando le funzioni della libreria SDK appropriate sulla piattaforma specificata.

source: Typically this means :cpp:enumerator:`LV_COLOR_FORMAT_RGB565`, :cpp:enumerator:`LV_COLOR_FORMAT_RGB888`, :cpp:enumerator:`LV_COLOR_FORMAT_XRGB888`, and :cpp:enumerator:`LV_COLOR_FORMAT_ARGB8888`.
it_it: In genere, questo significa :cpp:enumerator:`LV_COLOR_FORMAT_RGB565`, :cpp:enumerator:`LV_COLOR_FORMAT_RGB888`, :cpp:enumerator:`LV_COLOR_FORMAT_XRGB888` e :cpp:enumerator:`LV_COLOR_FORMAT_ARGB8888`.

source: Typically this means the property with :cpp:enumerator:`LV_STATE_DEFAULT` is used.
it_it: In genere, questo significa che viene utilizzata la proprietà con :cpp:enumerator:`LV_STATE_DEFAULT`.

source: Typically, a flag would be set inside the interrupt handler which would be checked and reset inside the indev read callback where the reading would actually be taken.
it_it: In genere, un flag verrebbe impostato all'interno del gestore di interrupt, che verrebbe controllato e reimpostato all'interno della callback di lettura indev, dove la lettura verrebbe effettivamente eseguita.

source: Typically, asset formats like PNG are already compressed.
it_it: In genere, i formati di risorse come PNG sono già compressi.

source: Typically, you would do this with a target color format matching the Display the image is going to be sent to.
it_it: In genere, si esegue questa operazione con un formato colore di destinazione corrispondente al display a cui verrà inviata l'immagine.

source: UART Smart Displays
it_it: Display Intelligenti UART

source: UART/RS232/RS485/CAN Interfaces and redundant IO interfaces are included to facilitate extended usage.
it_it: Interfacce UART/RS232/RS485/CAN e interfacce IO ridondanti sono incluse per facilitarne l'utilizzo prolungato.

source: UDP streaming for low-latency applications
it_it: Streaming UDP per applicazioni a bassa latenza

source: UI Elements
it_it: Elementi dell'interfaccia utente

source: UI Testing
it_it: Test dell'interfaccia utente

source: UIs can be created based on the current environment of the device.
it_it: Le interfacce utente possono essere create in base all'ambiente corrente del dispositivo.

source: URLs are converted to links automatically.
it_it: Gli URL vengono convertiti automaticamente in link.

source: Under "MCU GCC Compiler", "Include paths", add an entry to "Include paths (-I)" which is a path to "libs/nema_gfx/include" e.g. "${workspace_loc:/${ProjName}/Middlewares/LVGL/lvgl/libs/nema_gfx/include}".
it_it: In "MCU GCC Compiler", "Include paths", aggiungere una voce a "Include paths (-I)" che corrisponde al percorso di "libs/nema_gfx/include" ad esempio "${workspace_loc:/${ProjName}/Middlewares/LVGL/lvgl/libs/nema_gfx/include}".

source: Under "Run and Debug" \> "Run Configuration" (column) \> "alif" (row), click the dropdown and select "First time pack installation".
it_it: In "Run and Debug" \> "Run Configuration" (column) \> "alif" (row), cliccare sul menù a discesa e selezionare "First time pack installation".

source: Under the Hood
it_it: Dietro le Quinte

source: Under the hood Spinbox is a :ref:`lv_textarea` with behaviors extended to enable a numeric value to be viewed and modified with configurable constraints.
it_it: Spinbox è una :ref:`lv_textarea` con comportamenti estesi per consentire la visualizzazione e la modifica di un valore numerico con vincoli configurabili.

source: Under the hood, it uses ``kconfiglib`` Kconfig python port to be able to use it across different platforms.
it_it: Internamente, utilizza la porta Python di Kconfig ``kconfiglib`` per poterlo utilizzare su diverse piattaforme.

source: Under the hood, position, size, and alignment are all style properties.
it_it: In pratica, posizione, dimensione e allineamento sono tutte proprietà di stile.

source: Understanding how timelines work internally helps in using them effectively.
it_it: Capire il funzionamento interno delle timeline aiuta a utilizzarle in modo efficace.

source: Unfortunately, finding a good set of parameters is not easy.
it_it: Purtroppo, trovare un buon set di parametri non è facile.

source: Unicode Support
it_it: Supporto Unicode

source: Universal compatibility with all Wayland compositors
it_it: Compatibilità universale con tutti i compositori Wayland

source: Unlike CSS (where pseudo-classes_ describe different states, e.g. ``:focus``), in LVGL a property is assigned to a given state.
it_it: A differenza di CSS (dove le pseudo-classes_ descrivono stati diversi, ad esempio ``:focus``), in LVGL una proprietà viene assegnata a un determinato stato.

source: Unlike Widgets (which are always compiled into the application), Components can either:
it_it: A differenza dei widget (che vengono sempre compilati nell'applicazione), i Componenti possono:

source: Unlike ``lv_obj_align``, this alignment is not persistent—repositioning ``btn`` won’t update ``label``.
it_it: A differenza di ``lv_obj_align``, questo allineamento non è persistente: riposizionare ``btn`` non aggiornerà ``label``.

source: Unlike ``translate``, this is a visual-only effect and does **not** affect layout, scrollbar behavior, or container resizing.
it_it: A differenza di ``translate``, questo è un effetto solo visivo e **non** influisce sul layout, sul comportamento della barra di scorrimento o sul ridimensionamento del contenitore.

source: Unlike adding normal styles to Widgets, you cannot combine PARTs by bit-wise OR-ing the PART values together to get the style to apply to more than one part.
it_it: A differenza dell'aggiunta di stili normali ai Widget, non è possibile combinare le PARTI eseguendo l'operazione OR bit per bit sui valori delle PARTI per ottenere che lo stile venga applicato a più di una parte.

source: Unlike in CSS, LVGL local styles can be assigned to states (pseudo-classes_) and parts (pseudo-elements_).
it_it: A differenza di CSS, gli stili locali LVGL possono essere assegnati a stati (pseudo-classes_) e parti (pseudo-elements_).

source: Unlike traditional mathematical lighting (where light sources are calculated with approximation functions), IBL captures the entire lighting environment in an image, producing natural-looking results with:
it_it: A differenza dell'illuminazione matematica tradizionale (in cui le sorgenti luminose vengono calcolate con funzioni di approssimazione), IBL cattura l'intero ambiente di illuminazione in un'immagine, producendo risultati dall'aspetto naturale con:

source: Unpack task unpacks the package that has been downloaded with Fetch task.
it_it: Il task "unpack" scompatta il pacchetto scaricato co task Fetch.

source: Unset options will get a default value which is the same as the content of ``lv_conf_template.h``.
it_it: Le opzioni non impostate otterranno un valore predefinito che è lo stesso del contenuto di ``lv_conf_template.h``.

source: Unset parameters fall back to:
it_it: I parametri non impostati vengono sostituiti da:

source: Unsubscribing from a Subject
it_it: Annullamento dell'iscrizione a un Subject

source: Until this section, everything was already done for you.
it_it: Fino a questa sezione, tutto era già stato preparato.

source: Up to 33% faster software rendering with on platforms that support NEON SIMD support.
it_it: Rendering software fino al 33% più veloce su piattaforme che supportano NEON SIMD.

source: Up to 64 cores, up to 16TB of RAM
it_it: Fino a 64 core, fino a 16 TB di RAM

source: Up/down key events will be sent to the Widget that has focus.
it_it: Gli eventi dei tasti su/giù verranno inviati al Widget attivo.

source: Update Includes
it_it: Aggiornamento degli Include

source: Update RootFS
it_it: Aggiornare RootFS

source: Update mode
it_it: Modalità di aggiornamento

source: Update modes
it_it: Modalità di aggiornamento

source: Update the configuration.
it_it: Aggiornare la configurazione.

source: Updates expect the pointer to point to a NUL-terminated string.
it_it: Gli aggiornamenti si aspettano che il puntatore punti a una stringa terminata da NUL.

source: Upload font(s) and set the ranges and/or specify a list of characters to include and other parameters
it_it: Caricare i font e impostare gli intervalli e/o specificare un elenco di caratteri da includere e altri parametri

source: Upon assignment, the target part (pseudo-element_ in CSS) and target state (pseudo-class_ in CSS) can be specified.
it_it: Al momento dell'assegnazione, è possibile specificare la parte di destinazione (pseudo-element_ in CSS) e lo stato di destinazione (pseudo-class_ in CSS).

source: Upon completion, ensure that the image is listed by Docker:
it_it: Al termine, assicurarsi che l'immagine sia elencata da Docker:

source: Upon first launching the LVGL Editor for a project, it will create a `ui` sub-folder for the LVGL project.
it_it: Al primo avvio di LVGL Editor per un progetto, verrà creata una sottocartella `ui` per il progetto LVGL.

source: Usage
it_it: Utilizzo

source: Usage Example
it_it: Esempio di Utilizzo

source: Usage Modes With LVGL
it_it: Modalità di utilizzo con LVGL

source: Usage and Configuration
it_it: Utilizzo e Configurazione

source: Usage in LVGL
it_it: Utilizzo in LVGL

source: Usage in LVGL's UI Editor
it_it: Utilizzo nell'UI Editor di LVGL

source: Usage in XML
it_it: Utilizzo in XML

source: Usage in the Editor
it_it: Utilizzo nell'Editor

source: Use :c:macro:`LV_CHART_POINT_NONE` as value to make the library skip drawing that point, column, or scatter-point.
it_it: Usare :c:macro:`LV_CHART_POINT_NONE` come valore per fare in modo che la libreria salti il disegno di quel punto, colonna o punto di dispersione.

source: Use :cpp:enumerator:`LV_COLOR_FORMAT_ARGB8888` for gifs with transparency.
it_it: Si usa :cpp:enumerator:`LV_COLOR_FORMAT_ARGB8888` per le GIF con trasparenza.

source: Use :cpp:expr:`lv_chart_set_next_value(chart, series, value)`.
it_it: Usare :cpp:expr:`lv_chart_set_next_value(chart, series, value)`.

source: Use :cpp:expr:`lv_chart_set_series_value_by_id(chart, series, id, value)` where ``id`` is the zero-based index of the point you wish to update.
it_it: Utilizzare :cpp:expr:`lv_chart_set_series_value_by_id(chart, series, id, value)` dove ``id`` è l'indice a partire da zero del punto che si desidera aggiornare.

source: Use :cpp:expr:`lv_led_on(led)` and :cpp:expr:`lv_led_off(led)` to set the brightness to a predefined ON or OFF value.
it_it: Si usano :cpp:expr:`lv_led_on(led)` e :cpp:expr:`lv_led_off(led)` per impostare la luminosità su un valore predefinito ON o OFF.

source: Use :cpp:expr:`lv_obj_center(widget)` as a shortcut to center a widget.
it_it: Usare :cpp:expr:`lv_obj_center(widget)` come scorciatoia per centrare un widget.

source: Use :cpp:expr:`lv_obj_move_to_index(widget, idx)` to move a Widget to a new index.
it_it: Usare :cpp:expr:`lv_obj_move_to_index(widget, idx)` per spostare un Widget in un nuovo indice.

source: Use :cpp:expr:`lv_obj_swap(widget1, widget2)` to swap the layer positions (Z-orders) of the two Widgets.
it_it: Usare :cpp:expr:`lv_obj_swap(widget1, widget2)` per scambiare le posizioni del livello (ordine Z) dei due Widget.

source: Use :cpp:expr:`lv_spangroup_get_span_count(spangroup)` to get the number of contained Spans.
it_it: Su usa :cpp:expr:`lv_spangroup_get_span_count(spangroup)` per ottenere il numero di Span contenuti.

source: Use :cpp:expr:`lv_spangroup_set_indent(spangroup, 20)` to set the indent of the first line.
it_it: Usare :cpp:expr:`lv_spangroup_set_indent(spangroup, 20)` per impostare il rientro della prima riga.

source: Use :cpp:expr:`lv_spangroup_set_max_lines(spangroup, 10)` to set the maximum number of lines to be displayed in :cpp:enumerator:`LV_SPAN_MODE_BREAK` mode.
it_it: Usare :cpp:expr:`lv_spangroup_set_max_lines(spangroup, 10)` per impostare il numero massimo di righe da visualizzare in modalità :cpp:enumerator:`LV_SPAN_MODE_BREAK`.

source: Use :cpp:expr:`lv_spangroup_set_mode(spangroup, LV_SPAN_MODE_BREAK)` to set its mode.
it_it: Usare :cpp:expr:`lv_spangroup_set_mode(spangroup, LV_SPAN_MODE_BREAK)` per impostarne la modalità.

source: Use :cpp:expr:`lv_spangroup_set_overflow(spangroup, LV_SPAN_OVERFLOW_CLIP)` to set the Spangroup's overflow mode.
it_it: Si usa :cpp:expr:`lv_spangroup_set_overflow(spangroup, LV_SPAN_OVERFLOW_CLIP)` per impostare la modalità di overflow dello Spangroup.

source: Use :cpp:expr:`lv_spinner_set_anim_params(spinner, spin_duration, angle)` to customize the duration of one revolution and the length of the arc.
it_it: Usare :cpp:expr:`lv_spinner_set_anim_params(spinner, spin_duration, angle)` per personalizzare la durata di una rotazione e la lunghezza dell'arco.

source: Use :cpp:expr:`lv_tabview_set_active(tabview, tab_id, LV_ANIM_ON / OFF)` function
it_it: Usare la funzione :cpp:expr:`lv_tabview_set_active(tabview, tab_id, LV_ANIM_ON / OFF)`

source: Use :cpp:expr:`lv_xml_create(parent, "name", attributes)` to create any Widget, Component, or Screen at runtime from the registered XMLs.
it_it: Si usa :cpp:expr:`lv_xml_create(parent, "name", attributes)` per creare qualsiasi Widget, Componente o Screen in fase di esecuzione a partire dagli XML registrati.

source: Use :cpp:expr:`lv_xml_create_screen("name")`, where ``"name"`` is the name of the XML file or the name used when the XML data was registered.
it_it: Si usa :cpp:expr:`lv_xml_create_screen("name")`, dove ``"name"`` è il nome del file XML o quello utilizzato al momento della registrazione dei dati XML.

source: Use :cpp:expr:`lv_xml_register_component_from_data(name, xml_string)` and :cpp:expr:`lv_xml_register_component_from_file("A:path/to/my.xml")` to register the XML files defining Components, Screens, and ``globals.xml`` either as strings or file paths.
it_it: Si usa :cpp:expr:`lv_xml_register_component_from_data(name, xml_string)` and :cpp:expr:`lv_xml_register_component_from_file("A:path/to/my.xml")` per registrare i file XML che definiscono Componenti, Screen e ``globals.xml`` come stringhe o percorsi di file.

source: Use :cpp:expr:`lv_xml_register_widget("widget_name", create_cb, apply_cb)` for that.
it_it: Si usa :cpp:expr:`lv_xml_register_widget("widget_name", create_cb, apply_cb)` a tale scopo.

source: Use :cpp:func:`lv_barcode_create` to create a barcode object, and use :cpp:func:`lv_barcode_update` to generate a barcode.
it_it: Utilizzare :cpp:func:`lv_barcode_create` per creare un oggetto barcode e :cpp:func:`lv_barcode_update` per generare un codice a barre.

source: Use :cpp:func:`lv_draw_buf_destroy` to free the memory it allocated.
it_it: Si usa :cpp:func:`lv_draw_buf_destroy` per liberare la memoria allocata.

source: Use :cpp:func:`lv_font_manager_add_src_static` to add a mapping between font names and font resources to tell the font manager how to access the font resources.
it_it: Si usa :cpp:func:`lv_font_manager_add_src_static` per aggiungere una mappatura tra i nomi dei font e le risorse font per indicare al font manager come accedere alle risorse font.

source: Use :cpp:func:`lv_font_manager_create` to create a font manager, where the :cpp:func:`recycle_cache_size` parameter is used to set the number of font recycling caches, which can improve font creation efficiency.
it_it: Si usa :cpp:func:`lv_font_manager_create` per creare un font manager, dove il parametro :cpp:func:`recycle_cache_size` viene utilizzato per impostare il numero di cache di riciclo dei font, il che può migliorare l'efficienza della creazione dei font.

source: Use :cpp:func:`lv_font_manager_delete_font` to delete the font when it is no longer needed.
it_it: Si usa :cpp:func:`lv_font_manager_delete_font` per eliminare il font quando non è più necessario.

source: Use :cpp:func:`lv_font_manager_delete` to destroy the entire font manager.
it_it: Usare :cpp:func:`lv_font_manager_delete` per eliminare l'intero font manager.

source: Use :cpp:func:`lv_font_manager_remove_src` to remove the font resource mapping.
it_it: Utilizzare :cpp:func:`lv_font_manager_remove_src` per rimuovere la mappatura delle risorse font.

source: Use :cpp:func:`lv_monkey_get_indev` to get the input device, and use :cpp:func:`lv_indev_set_button_points` to map the key ID to the coordinates.
it_it: Si usa :cpp:func:`lv_monkey_get_indev` per ottenere il dispositivo di input e :cpp:func:`lv_indev_set_button_points` per mappare l'ID del tasto alle coordinate.

source: Use :cpp:func:`lv_obj_set_style_anim_duration` to set this value.
it_it: Si usa :cpp:func:`lv_obj_set_style_anim_duration` per impostare questo valore.

source: Use :cpp:func:`lv_obj_set_style_text_line_space` to set this value.
it_it: Si usa :cpp:func:`lv_obj_set_style_text_line_space` per impostare questo valore.

source: Use :cpp:func:`lv_qrcode_create` to create the QR-Code Widget.
it_it: Usare :cpp:func:`lv_qrcode_create` per creare il Widget QR-Code.

source: Use Drives for Images
it_it: Utilizzare i Drive per le Immagini

source: Use GIF Widget (File)
it_it: Usa il widget GIF (File)

source: Use GPL-licensed code
it_it: Utilizzare codice con licenza GPL

source: Use Git to clone the required repositories
it_it: Utilizzare Git per clonare i repository richiesti

source: Use LVGL in an STM32 HAL Project
it_it: Utilizzare LVGL in un progetto STM32 HAL

source: Use Lottie Widget
it_it: Usare il Widget Lottie

source: Use ORed states to describe the properties for complex cases (e.g. pressed + checked + focused).
it_it: Utilizzare gli stati con OR per descrivere le proprietà in casi complessi (ad esempio pressed + checked + focused).

source: Use OS-specific mechanism to block drawing thread.
it_it: Utilizza un meccanismo specifico del sistema operativo per bloccare il thread di disegno.

source: Use Rlottie from File
it_it: Utilizzare Rlottie da File

source: Use Rlottie from Raw String Data
it_it: Utilizzare Rlottie da Dati Stringa Grezzi

source: Use STM32CubeIDE or STM32CubeMX to generate LTDC initialization code.
it_it: Utilizzare STM32CubeIDE o STM32CubeMX per generare il codice di inizializzazione LTDC.

source: Use XML files with this Specification in your own projects.
it_it: Utilizzare file XML con questa Specifica nei propri progetti.

source: Use `LV_RADIUS_CIRCLE` for the maximum radius.
it_it: Utilizzare `LV_RADIUS_CIRCLE` per il raggio massimo.

# Use ``" "`` in the map to insert a **line break**.
source: Use ``"\n"`` in the map to insert a **line break**.
it_it: Utilizzare ``"\n"`` nella map per inserire un **line break** [andata-a-capo].

source: Use ``<stdint.h>`` (*uint8_t*, *int32_t* etc).
it_it: Usare ``<stdint.h>`` (*uint8_t*, *int32_t* ecc.).

source: Use ``LV_SIZE_CONTENT`` to size the widget based on its children:
it_it: Usare ``LV_SIZE_CONTENT`` per ridimensionare il widget in base ai suoi figli:

source: Use ``enum``\ s instead of macros.
it_it: Utilizzare ``enum`` invece delle macro.

source: Use ``lv_fragment_manager``
it_it: Usare ``lv_fragment_manager``

source: Use ``lv_wayland_assign_physical_display()`` to assign a window to a particular physical display, where the ``display`` parameter specifies the physical display number (typically 0, 1, 2, etc.):
it_it: Utilizzare ``lv_wayland_assign_physical_display()`` per assegnare una finestra a un particolare display fisico, dove il parametro ``display`` specifica il numero del display fisico (in genere 0, 1, 2, ecc.):

source: Use `lv_font_conv <https://github.com/lvgl/lv_font_conv/>`__ with the ``--format bin`` option to generate an LVGL compatible font file.
it_it: Si usa `lv_font_conv <https://github.com/lvgl/lv_font_conv/>`__ con l'opzione ``--format bin`` per generare un file font compatibile con LVGL.
